# Repaso librería Pandas

En esta sección aprenderemos como usar la librería de pandas para el análisis de datos. Algunos elemento importantes que veremos serán:

- Series
- DataFrame
- Missing Data
- GroupBy
- Merge, join, concat
- Operaciones 
- Datos de entrada y salida

## Series

In [1]:
import numpy as np
import pandas as pd

## Crear una serie
podemos convertir una lista, arreglo de numpy, o diccionario a series:

In [2]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10, 'b':20, 'c':30}

### Creando una Series usando listas

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

### Creando una serie usando un diccionario

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

### Creando una serie usando un arreglo

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

### Data en las series

In [9]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [10]:
pd.Series(data = labels, index = labels)

a    a
b    b
c    c
dtype: object

In [11]:
pd.Series(labels, labels)

a    a
b    b
c    c
dtype: object

### Usar un Indice en las Series

In [12]:
ser1 = pd.Series(data= [1,2,3,4], index=['USA','Germany','USSR', 'Japan'])

In [13]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [14]:
ser2 = pd.Series(data= [1,2,5,4], index=['USA','Germany','Italy', 'Japan'])

In [15]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [16]:
ser1['USA']

1

In [17]:
ser1.iloc[0]

1

In [18]:
ser1.loc['USA']

1

In [19]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrame

In [20]:
from numpy.random import randn
np.random.seed(101)

In [21]:
df = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [22]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

### Selección e Indexación

In [23]:
df.loc[:,'W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [24]:
df.iloc[:,0]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [25]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [26]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [27]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [28]:
type(df['W'])

pandas.core.series.Series

### Creando una nueva columna

In [29]:
df['W'] + df['Y']

A    3.614819
B   -0.196959
C   -1.489355
D   -0.744542
E    2.796762
dtype: float64

In [30]:
df['new'] = df['W'] + df['Y']

In [31]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

### Eliminar columnas

In [32]:
df.drop('new', axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [34]:
df.drop('new', axis = 1, inplace = True)

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
df.drop('E', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

### Seleccionar un subconjunto de filas y columnas

In [37]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df.loc['B','W']

0.6511179479432686

In [39]:
df.iloc[1,0]

0.6511179479432686

In [40]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [41]:
'A B'.split()

['A', 'B']

In [42]:
df.loc['A B'.split(),['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [43]:
df.loc['A B'.split(),'W Y'.split()]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

## Selección Condicional

In [44]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [46]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
x = df[df['W']>0]

In [48]:
x

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
x.Y

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [50]:
x['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [51]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [52]:
df[df['W']>0]['Y X'.split()]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [53]:
df[df['W']>0][['X','Y','Z']]

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [54]:
'A B C D E'.split()

['A', 'B', 'C', 'D', 'E']

In [55]:
'A B C D E'.split(' ')

['A', 'B', 'C', 'D', 'E']

In [56]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [58]:
df.iloc[:,:]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [59]:
df.max().max()

2.706849839399938

## Detalles sobre los indices

In [60]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [61]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [62]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [63]:
df.reset_index(inplace=True)

In [64]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [65]:
df.drop('index', axis=1, inplace=True)

In [66]:
df

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

crear una columna que llame states con los elementos = ['CA', 'NY', 'WY', 'OR', 'CO']

In [67]:
df['States'] =  ['CA', 'NY', 'WY', 'OR', 'CO']

In [68]:
df

          W         X         Y         Z States
0  2.706850  0.628133  0.907969  0.503826     CA
1  0.651118 -0.319318 -0.848077  0.605965     NY
2 -2.018168  0.740122  0.528813 -0.589001     WY
3  0.188695 -0.758872 -0.933237  0.955057     OR
4  0.190794  1.978757  2.605967  0.683509     CO

In [69]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [70]:
df

          W         X         Y         Z States
0  2.706850  0.628133  0.907969  0.503826     CA
1  0.651118 -0.319318 -0.848077  0.605965     NY
2 -2.018168  0.740122  0.528813 -0.589001     WY
3  0.188695 -0.758872 -0.933237  0.955057     OR
4  0.190794  1.978757  2.605967  0.683509     CO

In [71]:
df.set_index('States', inplace=True)

In [72]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## DataFrame Resumen

In [73]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [74]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [75]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

## Datos Faltantes (Missing Data)

In [77]:
df = pd.DataFrame({'A': [1,2,np.nan],
                    'B': [5, np.nan, np.nan],
                    'C': [1,2,3]})

In [78]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [79]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [80]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [81]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [82]:
df.dropna(thresh=2, axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [83]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [84]:
df.fillna(value='missing')

         A        B  C
0        1        5  1
1        2  missing  2
2  missing  missing  3

In [85]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [86]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [87]:
df['B'].fillna(value=df['A'].mean())

0    5.0
1    1.5
2    1.5
Name: B, dtype: float64

## Groupby
este método nos permite agrupar filas de datos y utilizar funciones de agregación

In [88]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person' : ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sara'],
         'Sales': [200,120,340,124,243,350]}

In [89]:
df = pd.DataFrame(data)

In [90]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB     Sara    350

In [92]:
by_comp = df.groupby('Company')

In [93]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [94]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [95]:
df.groupby('Company').max()

          Person  Sales
Company
FB          Sara    350
GOOG         Sam    200
MSFT     Vanessa    340

In [96]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [97]:
df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [98]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [99]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [101]:
df2 = df.groupby('Company').describe().transpose()

In [102]:
df2

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [103]:
df2['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

## Operaciones

In [105]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2': [444,555,666,444],
                   'col3': ['abc','def','ghi','xyz']})

In [106]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [111]:
df.head(10)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [116]:
df.tail(10)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

## Info de Valores Unicos

In [117]:
df['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [118]:
df['col2'].unique()

array([444, 555, 666])

In [119]:
df['col2'].nunique()

3

In [120]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Seleccionen de la columna 1 'col1' > 2 y de la columna 2 'col2' los datos que sean == 444 y este resultado guardarlo en un nuevo dataframe que se llame 'newdf'

In [123]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [124]:
df[df['col2']==444]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [125]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

## Definir y aplicar funciones a nuestro dataframe

In [126]:
def times2(x):
    return 2*x

In [127]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [128]:
df['col1'] = df['col1'].apply(times2)
df['col2'] = df['col2'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [132]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [133]:
del df['col1']

In [134]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [135]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [136]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [137]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [145]:
df.sort_values(by='col2', inplace=True, ascending= False)

In [146]:
df

   col2 col3
2   666  ghi
1   555  def
0   444  abc
3   444  xyz

## Entrada y salida de datos

'example.csv'

In [147]:
df = pd.read_csv('../Data/example.csv')

In [148]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### Crear una función que reciba como argumento de entrada 'x' y lo eleve al cubo. Después, aplicar esta función a las columnas 'a' y 'c' del dataframe 'df'

In [149]:
def cubo_fcn(x):
    return x**3

In [150]:
df['a']=df['a'].apply(cubo_fcn)

In [151]:
df['c']=df['c'].apply(cubo_fcn)

In [152]:
df

      a   b     c   d
0     0   1     8   3
1    64   5   216   7
2   512   9  1000  11
3  1728  13  2744  15

In [153]:
df.to_csv('../Data/example_modificado.csv')

Excel_Sample.xlsx

In [154]:
df_excel = pd.read_excel('../Data/Excel_Sample.xlsx')

In [155]:
df_excel

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [156]:
del df_excel['Unnamed: 0']

In [157]:
df_excel

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### eliminar la columna 'Unnamed: 0'

In [158]:
df_excel.to_excel('../Data/Excel_Sample_modificado.xlsx')